cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_ПубличныйAPI/Ext/Module.bsl
// Версия публичного контракта прикладного вызова.
Функция ВерсияИнтерфейса() Экспорт

	Возврат "1.1";

КонецФункции

// Возвращает структуру всех поддерживаемых параметров прикладного вызова.
// КонтекстJSON должен содержать JSON-объект с версией схемы в ВерсияКонтекста.
Функция ПараметрыВыполнения() Экспорт

	Параметры = Новый Структура;
	Параметры.Вставить("КодСценария", "");
	Параметры.Вставить("Сценарий", Справочники.AI_Сценарии.ПустаяСсылка());
	Параметры.Вставить("ИдемпотентныйКлюч", "");
	Параметры.Вставить("ИдентификаторКорреляции", Неопределено);
	Параметры.Вставить("Источник", Неопределено);
	Параметры.Вставить("ТипИсточника", "");
	Параметры.Вставить("КлючИсточника", "");
	Параметры.Вставить("ПредставлениеИсточника", "");
	Параметры.Вставить("ВерсияКонтекста", 1);
	Параметры.Вставить("КонтекстJSON", "");
	Параметры.Вставить("Приоритет", 0);
	Параметры.Вставить("ЗапуститьНемедленно", Истина);
	Параметры.Вставить("РазрешитьПовтор", Ложь);
	Параметры.Вставить("МаксимумПопыток", 1);
	Параметры.Вставить("Провайдер", Справочники.AI_Провайдеры.ПустаяСсылка());
	Параметры.Вставить("Модель", Справочники.AI_Модели.ПустаяСсылка());
	Параметры.Вставить("ТипAPI", Неопределено);
	Параметры.Вставить("Агент", Справочники.AI_Агенты.ПустаяСсылка());
	Параметры.Вставить("Промт", "");
	Параметры.Вставить("СистемныйПромт", "");
	Параметры.Вставить("ДанныеКонтекста", "");
	Параметры.Вставить("Вложения", Новый Массив);

	Возврат Параметры;

КонецФункции

// Ставит прикладной вызов в выполнение и сразу возвращает идентификаторы.
// Повтор одного идемпотентного ключа возвращает исходную операцию.
Функция НачатьВыполнение(Параметры) Экспорт

	Если Параметры = Неопределено Тогда
		ВызватьИсключение "Не переданы параметры выполнения агентской операции.";
	КонецЕсли;
	ВнутреннийРезультат = AI_АгентскиеОперации.НачатьПрикладнуюОперацию(Параметры);
	Возврат Новый Структура(
		"ИдентификаторОперации,ИдентификаторКорреляции,ПовторныйВызов",
		ВнутреннийРезультат.ИдентификаторОперации,
		ВнутреннийРезультат.ИдентификаторКорреляции,
		ВнутреннийРезультат.ПовторныйВызов);

КонецФункции

// Возвращает состояние, результат, статистику и новые шаги операции.
Функция ПолучитьСостояние(ИдентификаторОперации, ПоследнийПолученныйШаг = 0) Экспорт

	Состояние = AI_АгентскиеОперации.ПолучитьИзменения(
		ИдентификаторОперации,
		ПоследнийПолученныйШаг);
	Состояние.Удалить("ИдентификаторДиалога");
	Возврат Состояние;

КонецФункции

// Возвращает полное текущее состояние; для незавершённой операции результат пуст.
Функция ПолучитьРезультат(ИдентификаторОперации) Экспорт

	Возврат ПолучитьСостояние(ИдентификаторОперации, 0);

КонецФункции

Процедура Отменить(ИдентификаторОперации) Экспорт

	AI_АгентскиеОперации.ЗапроситьОтмену(ИдентификаторОперации);

КонецПроцедуры

// Повторяет только прикладной обработчик; повторного обращения к модели нет.
Процедура ПовторитьДоставку(ИдентификаторОперации) Экспорт
	AI_КонтрактыОпераций.ПовторитьДоставку(ИдентификаторОперации);
КонецПроцедуры

Функция ОценитьРезультат(ИдентификаторОперации, Решение, Комментарий = "", ИсправленныйОтвет = "", ИдентификаторОценки = Неопределено) Экспорт
	Возврат AI_НаблюдаемостьОпераций.ЗаписатьОценку(ИдентификаторОперации, Решение, Комментарий, ИсправленныйОтвет, ИдентификаторОценки);
КонецФункции

Функция ПолучитьСтатистику() Экспорт
	Возврат AI_НаблюдаемостьОпераций.ПолучитьСтатистику();
КонецФункции

Функция ПолучитьОшибкиДоставки() Экспорт
	Возврат AI_НаблюдаемостьОпераций.ПолучитьОшибкиДоставки();
КонецФункции

Функция ПолучитьПоследниеОперации() Экспорт
	Возврат AI_НаблюдаемостьОпераций.ПолучитьПоследниеОперации();
КонецФункции

// Карточка одной операции: запрос, контекст, вложения с итогом анализа, ответ,
// ошибка, токены и шаги агента. Неопределено — операции нет или она чужая.
Функция ПолучитьОписаниеОперации(ИдентификаторОперации) Экспорт
	Возврат AI_НаблюдаемостьОпераций.ПолучитьОписаниеОперации(ИдентификаторОперации);
КонецФункции
